app/controllers/sessions_controller.rb

  def create
    user_data = MapMyFitness::User.new(request.env["omniauth.auth"])
    @user = User.find_or_create_by_auth(user_data)
---
INSERT INTO "users" ("created_at", "email", "updated_at", "username") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Tue, 07 Jan 2014 23:33:50 UTC +00:00], ["email", "luke@example.com"], ["updated_at", Tue, 07 Jan 2014 23:33:50 UTC +00:00], ["username", "Lucas M"]]